In [1]:
import pandas as pd
import numpy as np

from sklearn import tree

from sklearn.model_selection import train_test_split
from sklearn.preprocessing import minmax_scale
from sklearn.preprocessing import LabelEncoder
# 정답과 예측을 넣으면, 정확도를 산출해서 보여준다.
from sklearn.metrics import accuracy_score

In [2]:
baseData = pd.read_csv("../../dataset/keggledata.csv")

In [3]:
baseData

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [4]:
baseData.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [5]:
baseData.experience_level.drop_duplicates()

0     SE
1     MI
13    EN
58    EX
Name: experience_level, dtype: object

In [6]:
baseData.employment_type.drop_duplicates()

0      FT
1      CT
324    FL
971    PT
Name: employment_type, dtype: object

In [7]:
baseData.salary_currency.drop_duplicates()

0       EUR
1       USD
41      INR
80      HKD
114     CHF
157     GBP
218     AUD
219     SGD
322     CAD
528     ILS
972     BRL
998     THB
1165    PLN
2358    HUF
2684    CZK
2923    DKK
3475    JPY
3594    MXN
3597    TRY
3669    CLP
Name: salary_currency, dtype: object

In [8]:
baseData.employee_residence.drop_duplicates()

0       ES
1       US
3       CA
21      DE
23      GB
        ..
3638    RS
3657    NZ
3720    MD
3724    LU
3748    MT
Name: employee_residence, Length: 78, dtype: object

In [9]:
baseData.company_location.drop_duplicates()

0       ES
1       US
3       CA
21      DE
23      GB
        ..
3621    CN
3657    NZ
3669    CL
3720    MD
3748    MT
Name: company_location, Length: 72, dtype: object

In [10]:
baseData.company_size.drop_duplicates()

0    L
1    S
3    M
Name: company_size, dtype: object

In [11]:
Label = LabelEncoder()

In [12]:
baseData["experience_level_no"] = Label.fit_transform(baseData.experience_level)

In [13]:
baseData["employment_type_no"] = Label.fit_transform(baseData.employment_type)

In [14]:
baseData["salary_currency_no"] = Label.fit_transform(baseData.salary_currency)

In [15]:
baseData["employee_residence_no"] = Label.fit_transform(baseData.employee_residence)

In [16]:
baseData["employee_residence_no"] = Label.fit_transform(baseData.company_location)

In [17]:
baseData["company_size_no"] = Label.fit_transform(baseData.company_size)

In [18]:
baseData

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,experience_level_no,employment_type_no,salary_currency_no,employee_residence_no,company_size_no
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L,3,2,7,25,0
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S,2,0,19,70,2
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S,2,0,19,70,2
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M,3,2,19,12,1
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M,3,2,19,12,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L,3,2,19,70,0
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L,2,2,19,70,0
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S,0,2,19,70,2
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L,0,0,19,70,0
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L,3,2,12,38,0

In [19]:
corrDf = baseData.corr()
stdRaio = 0.3
corrDf

,work_year,salary,salary_in_usd,remote_ratio,experience_level_no,employment_type_no,salary_currency_no,employee_residence_no,company_size_no
work_year,1.000000,-0.094724,0.228290,-0.236430,0.187748,0.011127,0.254548,0.234661,0.138875
salary,-0.094724,1.000000,-0.023676,0.028731,-0.024884,-0.003908,-0.091121,-0.072774,-0.100352
salary_in_usd,0.228290,-0.023676,1.000000,-0.064171,0.327173,-0.010329,0.430450,0.405183,-0.000372
remote_ratio,-0.236430,0.028731,-0.064171,1.000000,-0.054025,-0.028673,-0.046644,-0.071574,-0.036928
experience_level_no,0.187748,-0.024884,0.327173,-0.054025,1.000000,-0.032794,0.225464,0.250591,0.066414
employment_type_no,0.011127,-0.003908,-0.010329,-0.028673,-0.032794,1.000000,-0.048446,-0.013963,-0.041001
salary_currency_no,0.254548,-0.091121,0.430450,-0.046644,0.225464,-0.048446,1.000000,0.764744,0.102738
employee_residence_no,0.234661,-0.072774,0.405183,-0.071574,0.250591,-0.013963,0.764744,1.000000,0.041703
company_size_no,0.138875,-0.100352,-0.000372,-0.036928,0.066414,-0.041001,0.102738,0.041703,1.000000

In [20]:
feature = list(corrDf.loc[(abs(corrDf.salary_in_usd)>stdRaio)&(abs(corrDf.salary_in_usd)!=1)].index)
feature

['experience_level_no', 'salary_currency_no', 'employee_residence_no']

In [21]:
label = ["salary_in_usd"]

In [22]:
featureData = baseData.loc[:,feature]
featureData.shape

(3755, 3)

In [23]:
labelData = baseData.loc[:,label]
labelData.shape

(3755, 1)

In [24]:
trainDataFeat,\
testDataFeat,\
trainDataLabel,\
testDataLabel = train_test_split(featureData, labelData, test_size=0.3, random_state=10)

In [25]:
print(trainDataFeat.shape)
print(trainDataLabel.shape)
print(testDataFeat.shape)
print(testDataLabel.shape)

(2628, 3)
(2628, 1)
(1127, 3)
(1127, 1)

In [26]:
testIndex = testDataLabel.index

In [27]:
dtModel = tree.DecisionTreeRegressor(random_state=10)

In [28]:
dtModel.fit(X = trainDataFeat, y = trainDataLabel)

DecisionTreeRegressor(random_state=10)

In [29]:
predict = dtModel.predict(X = testDataFeat)
predictData = pd.DataFrame(predict, columns=["predict"])

In [30]:
testDataLabel.reset_index(drop=True, inplace=True)

In [31]:
resultData = pd.concat([testDataLabel, predictData], axis=1)
resultData

      salary_in_usd        predict
0            116000  159346.918342
1            204500  159346.918342
2            220000  127824.142012
3            108000  159346.918342
4            193900  127824.142012
...             ...            ...
1122          45760  127824.142012
1123          81666  159346.918342
1124         136000  159346.918342
1125         150000  159346.918342
1126         145000  159346.918342

[1127 rows x 2 columns]

In [32]:
feature

['experience_level_no', 'salary_currency_no', 'employee_residence_no']

In [33]:
baseFeat = []
for i in range (0,len(feature)) : 
    splitFeat = feature[i].split("_")
    baseFeat.append(splitFeat[0] + "_" + splitFeat[1])
baseFeat

['experience_level', 'salary_currency', 'employee_residence']

In [34]:
conData = baseData.loc[testIndex,baseFeat]

In [35]:
conData.reset_index(drop=True, inplace=True)

In [36]:
finalData = pd.concat([conData, resultData], axis=1)
finalData

,experience_level,salary_currency,employee_residence,salary_in_usd,predict
0,SE,USD,US,116000,159346.918342
1,SE,USD,US,204500,159346.918342
2,MI,USD,US,220000,127824.142012
3,SE,USD,US,108000,159346.918342
4,MI,USD,US,193900,127824.142012
...,...,...,...,...,...
1122,MI,USD,PH,45760,127824.142012
1123,SE,USD,US,81666,159346.918342
1124,SE,USD,US,136000,159346.918342
1125,SE,USD,US,150000,159346.918342
1126,SE,USD,US,145000,159346.918342

In [37]:
feature

['experience_level_no', 'salary_currency_no', 'employee_residence_no']

In [38]:
featureData.experience_level_no.drop_duplicates()
print("residenxe" , min(featureData.experience_level_no),
max(featureData.experience_level_no))

residenxe 0 3

In [39]:
featureData.salary_currency_no.drop_duplicates()
print("residenxe" , min(featureData.salary_currency_no),
max(featureData.salary_currency_no))

residenxe 0 19

In [40]:
featureData.employee_residence_no.drop_duplicates()
print("residenxe" , min(featureData.employee_residence_no),
max(featureData.employee_residence_no))

residenxe 0 71

In [41]:
inExprience = 0
inSalary = 15
inResidence = 71

In [42]:
testData = pd.DataFrame([[inExprience,inSalary,inResidence]])
testData

   0   1   2
0  0  15  71

In [43]:
result = dtModel.predict(X = testData)
print("지급 급여 :",result[0])

지급 급여 : 65257.0

C:\Users\WIN\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeRegressor was fitted with feature names
  warnings.warn(